programming.org
* lang

- c
- [[file:perl.org][perl]]
- [[file:ruby.org][ruby]]
- [[file:lisp.org][lisp]]

* that's it? or lots of more ^^;

- network
- repository (database, storage)
- web
- (w)as include logic
- mobile

* logic

- game
- AI

* 노트

영역은 어떻게 될까? 운영체제, 에이전트, 현실에서 보지 못한 것을 보게되는 것, 플랫폼의 다양성, 센서, 버그 완전한 프로그램은 없고 벽은 구멍이 있다 단지 치즈의 구멍이 아닐 뿐이다. 

잘 알려진 프로그램을 사용하고, 백신을 사용하면 안전하게 사용할 수 있을까? 아니 아니다 확실히 아니다 단지 미친 짓일 뿐이다

마치 IDS 그리고 IPS에 대한 이야기를 하게 되는 것 같다. 사전적 정보에 의한 Detection 그리고 판단에 의한 Prevention 으로의 가능성이다. 

화이트 리스트는 있다. 화이트 리스트와 유사한 속성을 가질 수 있다. 마치 http로 가장한 공격 말이다. 특이성의 추출이다. anomaly detection 이다. 기존의 패턴이 아니면 그건 다른 것이다 물론 꼭 악성일 수는 없지만 화이트 리스트에 없다면 그건 거부한다. 그 패턴의 규모가 있기도 하다 그 크기를 규정하지는 않다. 아마도 최대는 1년 정도가 아니면 4년 정도가 될 것이다. 일반적으로는 1주를 보는 것이 맞다. 1달도 허용가능한 범위다. 작업 가능한 범위 말이다. 단 1년이 4년이 되었을 때는 조금 그 규정의 범위를 넓힐 필요가 있다.

이 이게 프로그램에 대한 노트가 맞나?
