programming.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>programming</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="programming"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2014-09-14T19:26+0900"/>
<meta name="author" content="taeyoungchoon"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>



</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">programming</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 lang</a></li>
<li><a href="#sec-2">2 that's it? or lots of more ^^;</a></li>
<li><a href="#sec-3">3 logic</a></li>
<li><a href="#sec-4">4 노트</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> lang</h2>
<div class="outline-text-2" id="text-1">


<ul>
<li>c
</li>
<li><a href="perl.html">perl</a>
</li>
<li><a href="ruby.html">ruby</a>
</li>
<li><a href="lisp.html">lisp</a>
</li>
</ul>


</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> that's it? or lots of more ^^;</h2>
<div class="outline-text-2" id="text-2">


<ul>
<li>network
</li>
<li>repository (database, storage)
</li>
<li>web
</li>
<li>(w)as include logic
</li>
<li>mobile
</li>
</ul>


</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> logic</h2>
<div class="outline-text-2" id="text-3">


<ul>
<li>game
</li>
<li>AI
</li>
</ul>


</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> 노트</h2>
<div class="outline-text-2" id="text-4">


<p>
영역은 어떻게 될까? 운영체제, 에이전트, 현실에서 보지 못한 것을 보게되는 것, 플랫폼의 다양성, 센서, 버그 완전한 프로그램은 없고 벽은 구멍이 있다 단지 치즈의 구멍이 아닐 뿐이다. 
</p>
<p>
잘 알려진 프로그램을 사용하고, 백신을 사용하면 안전하게 사용할 수 있을까? 아니 아니다 확실히 아니다 단지 미친 짓일 뿐이다
</p>
<p>
마치 IDS 그리고 IPS에 대한 이야기를 하게 되는 것 같다. 사전적 정보에 의한 Detection 그리고 판단에 의한 Prevention 으로의 가능성이다. 
</p>
<p>
화이트 리스트는 있다. 화이트 리스트와 유사한 속성을 가질 수 있다. 마치 http로 가장한 공격 말이다. 특이성의 추출이다. anomaly detection 이다. 기존의 패턴이 아니면 그건 다른 것이다 물론 꼭 악성일 수는 없지만 화이트 리스트에 없다면 그건 거부한다. 그 패턴의 규모가 있기도 하다 그 크기를 규정하지는 않다. 아마도 최대는 1년 정도가 아니면 4년 정도가 될 것이다. 일반적으로는 1주를 보는 것이 맞다. 1달도 허용가능한 범위다. 작업 가능한 범위 말이다. 단 1년이 4년이 되었을 때는 조금 그 규정의 범위를 넓힐 필요가 있다.
</p>
<p>
이 이게 프로그램에 대한 노트가 맞나?
</p></div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2014-09-14T19:26+0900</p>
<p class="author">Author: taeyoungchoon</p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.3f with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
